#include <stdio.h>

int main()
{
    int n = 3; // Кількість рядків
    int m = 4; // Кількість стовпців

    // Оголошення та введення матриці А
    int A[n][m];
    printf("Введіть елементи матриці А:\n");
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            scanf("%d", &A[i][j]);
        }
    }

    // Знаходження добутку мінімальних елементів стовпців
    int minElements[m]; // Масив для збереження мінімальних елементів стовпців
    for (int j = 0; j < m; j++)
    {
        int min = A[0][j]; // Початкове значення мінімального елементу для поточного стовпця

        // Знаходження мінімального елементу в стовпці
        for (int i = 1; i < n; i++)
        {
            if (A[i][j] < min)
            {
                min = A[i][j];
            }
        }

        minElements[j] = min; // Збереження мінімального елементу
    }

    // Обчислення добутку мінімальних елементів
    int product = 1;
    for (int j = 0; j < m; j++)
    {
        product *= minElements[j];
    }

    // Виведення результату
    printf("Добуток мінімальних елементів = %d\n", product);

    return 0;
}
